"""
Keras 是一个高级神经网络API，最初由 François Chollet 开发，它被设计成用户友好且易于使用的深度学习库。
最初是一个独立的开源项目，后来被整合到 TensorFlow 生态系统中，成为 TensorFlow 的高级API之一。以下是 Keras 的主要特点和特性：

用户友好和简洁： Keras 的设计目标之一是提供简单而直观的接口，使用户能够轻松定义、
训练和评估神经网络模型，无论是初学者还是经验丰富的深度学习研究人员。

模块化和可扩展： Keras 支持模块化设计，用户可以通过堆叠、组合不同的层来构建复杂的神经网络。
它还允许用户自定义和添加自己的层，以满足特定的需求。

多后端支持： Keras 最初是一个独立的库，但后来被整合到 TensorFlow 中。除了 TensorFlow，
Keras 也支持其他深度学习后端，如 Microsoft Cognitive Toolkit (CNTK) 和 Theano。这使得用户可以选择使用适合其需求的后端。

内置网络层： Keras 提供了丰富的内置神经网络层，包括全连接层、卷积层、池化层等，以及激活函数、正则化等功能。这简化了构建模型的过程。

支持多种任务： Keras 不仅仅用于构建深度学习模型，还支持各种任务，包括图像分类、
文本生成、序列到序列学习等。它也提供了一些预训练模型，方便用户快速应用于不同任务。

广泛的文档和社区支持： Keras 拥有丰富的文档和社区支持，使用户能够轻松找到帮助和资源。
由于其易用性和流行度，Keras 成为许多深度学习教程和示例中的首选工具。

与 TensorFlow 的集成： Keras 已成为 TensorFlow 的官方高级API，
通过 tf.keras 命名空间集成到 TensorFlow 中。这使得用户既可以使用 Keras 的高级接口，又能享受 TensorFlow 的底层功能。

"""